{"How likely is it that I get COVID once I am vaccinated": "It typically takes a few weeks for the body to build immunity (protection against the virus that causes COVID-19) after vaccination. That means it's possible a person could be infected with the virus that causes COVID-19 just before or just after vaccination and still get sick.", "How effective is the Pfizer COVID-19 vaccination": "The Pfizer-BioNTech COVID-19 vaccine is 95% effective in preventing the COVID-19 virus with symptoms.", "What are the long term side-effects of having COVID-19": "Long-term effects COVID-19 symptoms can sometimes persist for months. The virus can damage the lungs, heart and brain, which increases the risk of long-term health problems. Most people who have coronavirus disease 2019 (COVID-19) recover completely within a few weeks.", "Can you still spread COVID even if you are fully vaccinated": "Yes, you can still get COVID after being fully vaccinated.", "How does the COVID-19 vaccine work": "The COVID-19 vaccines produce protection against the disease, as a result of developing an immune response to the SARS-Cov-2 virus. Developing immunity through vaccination means there is a reduced risk of developing the illness and its consequences. This immunity helps you fight the virus if exposed.", "How long do I quarantine for if I tested positive for COVID-19": "If you continue to have no symptoms, you can be with others after 10 days have passed since you had a positive viral test for COVID-19.", "How long will vaccine immunity last": "Based on clinical trials, experts do know that vaccine-induced immunity should last a minimum of about three months.", "How many covid deaths occurred today": "17,332 deaths occurred.", "How many total vaccinations have been given in the US": "As of 6 a.m. EDT April 4, a total of 61,416,536 Americans had been fully vaccinated, or 18.5 percent of the country's population.", "Which country has had the greatest number of covid cases": "The United States.", "How many total covid cases have there been worldwide": "133M total cases worldwide.", "Once you are vaccinated and come in contact with someone who has Covid-19, even if you don’t get it or show symptoms can you still pass the virus to others": "None of the vaccines are 100 percent effective at preventing infections. So even if people don't get very sick with COVID-19, they may still contract an infection and can potentially transmit the virus to others.", "How many new cases in the USA today": "62,025 new cases in the USA", "How effective is the Moderna COVID-19 vaccines": "The Moderna vaccine was 94.1% effective at preventing symptomatic Covid-19 after the second dose.", "What is the recovery rate of COVID-19": "Early estimates predict that the overall COVID-19 recovery rate is between 97% and 99.75%.", "What are common COVID-19 symptoms": "Fever or chills, Cough, Shortness of breath or difficulty breathing, Fatigue, Muscle or body aches, Headache, New loss of taste or smell, Sore throat, Congestion or runny nose", "How long will the Covid-19 vaccine last": "New research finds that mRNA COVID-19 vaccines provide immunity for at least 6 months. But since COVID-19 is so new, experts aren’t sure if immunity will wane after that.", "Should I get the vaccine if I have already had Covid-19": "Yes, you should be vaccinated regardless of whether you already had COVID-19.", "Will we have to get a Covid-19 vaccination every year": "Although we are unsure how long immunity from the vaccine lasts, a study out of Charité – Universitätsmedizin Berlin suggests that the answer is yes for a few years, but may be unnecessary after a few years post-pandemic.", "Do we know if the vaccines given in the U.S. work against the new Covid variants now showing up": "The simple answer is yes. At this time, there is no evidence to suggest that these or any other strains of the COVID-19 virus are resistant to the current vaccines.", "Can people be immune to the COVID-19 virus": "Health experts don't know whether we really become immune to COVID-19 after we're infected. And if we do have immunity, we don't know how long it might last. Thus far, there have been only a few incidents of confirmed re-infections.", "How much of the US has been vaccinated": "Since COVID-19 vaccine distribution began in the United States on Dec. 14, more than 171 million doses have been administered, fully vaccinating over 64.4 million people or 19.4% of the total U.S. population.", "Why are some individuals unwilling to get the Covid-19 vaccine": "Concerns about safety, fear of unknown side effects, and misinformation about COVID-19 are some reasons why people may not accept the vaccine.", "How much of the world has been vaccinated": "More than 710 million vaccine doses have been administered worldwide, equal to 9.2 doses for every 100 people.", "What is the definition of a \"close contact\"": "Close contact is defined as someone who was within 6 feet for a total of 15 minutes or more within 2 days prior to illness onset, regardless of whether the contact was wearing a mask.", "Can vaccinated people spread the virus to non-vaccinated people": "It's possible. Experts say the risk is low, but are still studying how well the shots blunt the spread of the virus. The current vaccines are highly effective at preventing people from getting seriously sick with COVID-19.", "Can vaccinated people contract Covid": "Data has shown that you can still get coronavirus even after you're fully vaccinated.", "What is the risk of spreading the virus in an outdoor setting versus an indoor setting": "The chances of becoming infected with the virus are far slimmer outdoors than indoors. This applies to the original coronavirus as well as to its mutants. This is due to aerosols, which are tiny particles floating in the atmosphere, that play a key role in the spread of the virus. Experts say aerosols pose a smaller risk outdoors.", "What phase of vaccine distribution are we in in Michigan": "We are in phase 2.", "Do I need my second dose at exactly 21 days and is it less effective if I wait longer": "You should get your second shot as close to the recommended 3-week interval as possible. However, your second dose may be given up to 6 weeks (42 days) after the first dose and will still be effective.", "Are vaccine side effects worse if you've had Covid-19": "Research and anecdotal reports suggest that people with a previously diagnosed Covid-19 infection may have a stronger reaction and more side effects after their first dose of vaccine compared to those who were never infected with the virus.", "Will I test positive for COVID-19 on a viral test after I get the vaccine": "No. Neither the recently authorized and recommended vaccines nor the other COVID-19 vaccines currently in clinical trials in the United States can cause you to test positive on viral tests, which are used to see if you have a current infection.", "Can you contract the coronavirus disease from a package in the mail": "Coronaviruses are thought to be spread most often by respiratory droplets. Although the virus can survive for a short period on some surfaces, it is unlikely to be spread from domestic or international mail, products or packaging.", "Can diarrhea be an initial symptom of COVID-19": "Many people with COVID-19 experience gastrointestinal symptoms such as nausea, vomiting or diarrhea, sometimes prior to developing fever and lower respiratory tract signs and symptoms.", "Can antibiotics treat the coronavirus disease": "Antibiotics do not work on viruses, such as those that cause colds, flu, bronchitis, or runny noses, even if the mucus is thick, yellow, or green.", "Should asymptomatic persons also quarantine if someone at school tested positive for COVID-19": "Asymptomatic individuals who have had close contact with someone with COVID-19 should also quarantine for 14 days from the last contact with an infected person.", "Are masks effective against the coronavirus disease": "Masks are now recognized as one of the most effective available tools to mitigate the spread of COVID-19.", "Is Hydroxychloroquine approved to treat the coronavirus disease": "No. Hydroxychloroquine sulfate and some versions of chloroquine phosphate are FDA-approved to treat malaria. Hydroxychloroquine sulfate is also FDA-approved to treat lupus and rheumatoid arthritis.", "Can the coronavirus disease spread through food": "There is no evidence that people can get COVID-19 from eating food. However, sharing utensils and congregating around food service areas may present risks.", "Can COVID-19 symptoms get worse suddenly": "A person may have mild symptoms for about one week, then worsen rapidly. Let your doctor know if your symptoms quickly worsen over a short period of time.", "Can hot water kill the coronavirus disease": "Taking a hot bath will not prevent you from catching COVID-19. Your normal body temperature remains around 36.5°C to 37°C, regardless of the temperature of your bath or shower.", "Can adults spread COVID-19 to children": "We know at this point that children can catch coronavirus, and also that they can spread the disease, even if they don't have symptoms. The Centers for Disease Control suggest that children as well as adults keep a 6-foot distance from others outside their household, if possible.", "Am I infectious if I have a positive COVID-19 test result": "These people who have a positive test result should be considered infectious and remain isolated until they again meet criteria for discontinuation of isolation or of transmission-based precautions.", "Should I wear an N95 mask to protect myself from COVID-19": "The Centers for Disease Control and Prevention (CDC) does not recommend that the general public wear N95 respirators to protect themselves from respiratory diseases, including coronavirus (COVID-19).", "Can the coronavirus disease be spread through swimming pools": "There is no evidence that SARS-CoV-2, the virus that causes COVID-19, can spread to people through water in these places.", "Does the coronavirus disease spread through meat": "Currently, there is no evidence that you can get infected with the virus that causes COVID-19 by eating food, including wild hunted game meat. However, hunters can get infected with other diseases when processing or eating game.", "Are people with high blood pressure at risk of getting severely ill with COVID-19": "Growing data shows a higher risk of COVID-19 infections and complications in people with high blood pressure. Analysis of early data from both China and the U.S. shows that high blood pressure is the most commonly shared pre-existing condition among those hospitalized, affecting between 30% to 50% of the patients.", "How long does the coronavirus last on surfaces": "Coronaviruses on surfaces and objects naturally die within hours to days. Warmer temperatures and exposure to sunlight will reduce the time the virus survives on surfaces and objects.", "Can pets get sick from COVID-19": "A small number of pets (cats and dogs) have been confirmed to be infected with the virus that causes COVID-19, mostly after close contact with a person with COVID-19. Some pets did not show any signs of illness, but those pets that did get sick all had mild disease that could be taken care of at home.", "Will there be a Covid-21": "There would only be a Covid-21 if a new strain were to emerge that could escape the virus.", "How many people need to be protected with the Vaccine to reach group immunity": "It's estimated that 94% of the population must be immune to interrupt the chain of transmission.", "What is the activity with the highest risk of exposure": "Going to a bar is one of the activities with highest risk of exposure.", "How long does COVID-19 stay in my body": "The virus may remain in the body at low levels for up to 3 months after diagnosis.", "What are some ways to get better if suffering COVID-19 symptoms": "Treatment is aimed at relieving symptoms and includes rest, fluid intake and pain relievers.", "What risk do variants pose": "The new variants seem to spread more easily and quickly than other variants, which may lead to more cases of COVID-19. So far, studies suggest that antibodies generated through vaccination with currently authorized vaccines recognize these variants.", "If the vaccine gives you the virus, how come we don't test positive after getting vaccinated": "The vaccines do not consist of the entire genome of the SARS-CoV-2 virus, which causes Covid-19. Instead, these vaccines are made of a small region of the viral genome, which enters the host cell and “tricks” the cell into making a specific viral protein (i.e., the Spike protein) against which an immune response is generated. Therefore, mRNA-based vaccines will not cause a Covid-19 PCR test to be positive.", "How many days should pass by after being directly exposed to a positive case should we get tested": "Get tested immediately and again 5 to 7 days after your exposure if your first test was negative. If you develop symptoms, you should get tested immediately, even if you already had a negative test.", "Can you transmit covid-19 if you don't have symptoms": "You can spread COVID-19 before you show symptoms. Some people with the illness never have symptoms, but can still spread the disease.", "Will a booster shot be necessary after the vaccine": "Immunity will certainly fade, but researchers will not know for at least six months whether booster shots might be needed.", "Does Covid-19 affect infants": "Although rare, children under age 1 appear to be at higher risk of severe illness with COVID-19 than older children. This is likely due to their immature immune systems and smaller airways, which make them more likely to develop breathing issues with respiratory virus infections.", "Are all three vaccines effective against all of the variants": "Even if the current vaccines are less effective against some variants, they still provide some level of protection from becoming sick with COVID-19. Additionally, when more people have some immunity, the transmission of the virus can be slowed.", "Will the pandemic ever end": "Harvard immunologist said current vaccines appear to be effective enough to end the pandemic, despite growing concerns that more infectious COVID-19 variants would severely blunt the effectiveness of the preventative treatments and set the nation back in its fight against the disease.", "Should I wear a mask if I am vaccinated": "After you've been fully vaccinated against COVID-19 you should continue wearing a mask in public places until we know more.", "Are people will allergies more susceptible to Covid-19": "At this point, we do not know. While people with compromised immune systems are at higher risk of severe COVID-19, people with allergies don’t have a compromised immune system; their allergies are actually an overreaction of the immune system.", "Would you be able to get the second round of the shot if you have an anaphylactic reaction": "If you had a severe allergic reaction—also known as anaphylaxis—after getting the first shot of a COVID-19 vaccine, CDC recommends that you not get a second shot of that vaccine.", "Should I get the covid-19 vaccine if I have covid-19": "No. People with COVID-19 who have symptoms should wait to be vaccinated until they have recovered from their illness and have met the criteria for discontinuing isolation; those without symptoms should also wait until they meet the criteria before getting vaccinated.", "Does the vaccine pose a higher risk for someone that is pregnant": "Based on how these vaccines work in the body, experts believe they are unlikely to pose a specific risk for people who are pregnant.", "Can anyone get the covid-19 vaccine": "The federal government is providing the vaccine free of charge to all people living in the United States, regardless of their immigration or health insurance status.", "Why is it called COVID-19": "In COVID-19, 'CO' stands for 'corona,' 'VI' for 'virus,' and 'D' for disease.", "Can children be vaccinated for covid-19": "The COVID-19 vaccine is currently not authorized for use in children under the age of 16.", "How many people have died of covid-19": "2,982,891 total people have died from COVID-19 so far.", "Where was the first covid case": "The initial outbreak was linked to a large seafood and live animal market in Wuhan, China.", "When was the first reported covid-19 case": "The first COVID-19 cases were reported in December, 2019.", "Can I get the covid vaccine if I am sick": "You should wait until you are recovered from your illness before getting your vaccine to keep from spreading the illness.", "Does cooking kill the covid virus": "Per the WHO, heat at 56 degrees Celsius kills the SARS coronavirus at around 10,000 units per 15 minutes.", "Can you contract covid from kissing": "Yes, the virus that causes COVID-19 travels in saliva so kissing an infected person could transfer the virus to you.", "Who is authorized to administer covid vaccines": "Recommendations include authorizing community health workers, retired professionals, health professions students, pharmacists, dentists, and veterinarians to administer the COVID-19 vaccine.", "Why do I need to wear two masks": "Adding more layers of material to a mask or wearing two masks reduces the number of respiratory droplets containing the virus that come through the mask.", "How was the covid vaccine tested": "The process was a randomized double-blinded control trial, in which half the group received the vaccine and all were monitored for symptoms, side effects, and the COVID-19 virus.", "How contagious is COIVD-19": "The virus that causes COVID-19 appears to spread more efficiently than influenza but not as efficiently as measles, which is among the most contagious viruses known to affect people."}
